/****************************************Copyright (c)**************************************************
**                                      TXRFID
**                                    
**                                 http://www.txrfid.com
**
**--------------文件信息-------------------------------------------------------------------------
**文   件   名: TX_UART.c 
**创   建   人: TXRFID
**创 建 日  期: 
**描        述: 底层通信的头文件。
**
**-----------------修改记录--------------------------------------------------------------
** 修改内容:    1.

** 当前版本:    V1.0 
** 修 改 人:    TXRFID
** 修改日期:    2009.02.05
** 注    意: 
**--------------------------------------------------------------------------------------
**-----------------修改记录--------------------------------------------------------------
** 修改内容:    1.增加SetBaud
                2.去掉了Serial_Int中的延时

** 当前版本:    v1.2 
** 修 改 人:    TXRFID
** 修改日期:    2009年04月12日
** 注    意: 
**---------------------------------------------------------------------------------------
**
**-----------------修改记录--------------------------------------------------------------
** 修改内容:    1.

** 当前版本:    V2.0 
** 修 改 人:    TXRFID
** 修改日期:    2013.06.04
** 注    意: 
**--------------------------------------------------------------------------------------

**-----------------------------------------------------------------------------------------
****************************************************************************************/
#define TX_UART_GLOBALS 1
//#include "IoDefine.h"
#include "TX_B.h"
#include "TX_UART.h"


/*********************************************************************************************************
** 函数名称:        unsigned char Serial_Comm(void)
** 功能描述: 给TX模块发送命令.
             发送命令完毕后，启动定时器2为2毫秒溢出，若溢出计数达120次，共240毫秒内，TX模块未返回响应，
             则本次命令执行失败。
**
** 输　入: 
**         
**
** 输　出: 无
**
** 函数返回: 错误类型
**           
** 全局变量: 无
********************************************************************************************************/
unsigned char Serial_Comm(void)
{
        unsigned char ser_wdg=120;             //设定发送命令后等待TX模块返回数据的超时倍数120，120×2ms=240ms
        //if(Send_Data()!=COMM_OK)       //给TX模块发送数据
            // return COMM_ERR;
//
//	START_T2(RCAP2_2ms);           //打开并设定定时器2，设定定时时间为2ms
//	while(NEW_DATA==0&&ser_wdg!=0) //判断串口是否接收到新数据或定时器超时
//	{
//		if(TF2)
//		{
//			START_T2(RCAP2_2ms);					 //tf
//			ser_wdg--;
//		}
//	}
	
//	if(NEW_DATA)	           //如果串口接收到TX模块发送来的新数据
//	{
//		NEW_DATA=0;           //清新数据标志为，为下次接收做准备
//		return COMM_OK;       //返回COMM_OK
//	}
//	else
        //{
        //    return COMM_ERR;      //如果在240ms内都没有接收到新数据，则返回COMM_ERR
        //}
}





