var d = {
    data: {
        indictor: [ "https://fuss10.elemecdn.com/d/82/ca60a5f3486c4a1f7f8fd1be328dcpng.png", "https://fuss10.elemecdn.com/7/f7/80dd7d82b277546739bedbfa29768png.png", "https://fuss10.elemecdn.com/6/14/97d54bb0be47578fd3daca5b44c4dpng.png" ],
        rules: [ "每位用户每天至多可以领取5个通用红包，店铺红包个数不限。", "使用通用红包时的下单手机号需为抢红包时使用的手机号。", "若用户使用领取的红包下单，订单取消后，红包将会失效。", "发放至手机号的红包需在 App 用手机号注册，或将手机号绑定至饿了么账户后才可使用。", "发放至饿了么账户的红包登录后即可使用。", "红包仅限在线支付时使用，每张订单仅限使用一张红包，红包不找零。", "店铺红包核销返现，仅限您的好友领取你分享的红包，并且第一次在店铺下单使用领取的红包后，才可返现。", "若用户账户被核实为风险用户，则不予返现。", "饿了么保留法律范围内允许的对活动的解释权。" ],
        q1: [ "一定要让朋友在指定的店铺使用此店铺红包下单", "如果朋友是第一次在此店铺下单，并使用了你分享的店铺红包，你直接赚到不定额现金", "如果朋友是第一次使用饿了么，且使用你分享的红包在对应店铺下单，你再赚到5元现金" ],
        q2: "成功获得的现金会放入「饿了么 App -钱包-余额」中，可以提现到银行卡，还可以购买商品哦~"
    }
};

Page(d);